---
kind: type
id: T:Autodesk.Revit.DB.ExtensibleStorage.ContainerType
source: html/15c76041-461b-9c8c-09c3-37c993d21718.htm
---
# Autodesk.Revit.DB.ExtensibleStorage.ContainerType

An enumerated type indicating if the field represents a single value or a container of multiple values.

## Syntax (C#)
```csharp
public enum ContainerType
```